In [1]:
import pandas as pd
import numpy as np

In [2]:
population = pd.read_csv('data/WorldBank_world_population.csv', skiprows=3)
gdp_percap = pd.read_csv('data/WorldBank_world_gdpercap.csv', skiprows=3)

In [16]:
population.shape, gdp_percap.shape

((264, 64), (264, 64))

`population` contains historical world population numbers.
`gdp_percap` contains GDP per capita data.

Assemble the two data frames in one data frame in long format.

The data should look like

| Year | Country Name | Country Code | Population | GDP per capita |
|------|--------------|--------------|------------|----------------|
| .... | ......       | ......       | ......     | .....          |

In [10]:
pop_df = population.set_index(['Country Name', 'Country Code']).iloc[:, 2:].stack().reset_index()
pop_df.columns = ['Country Name', 'Country Code', 'Year', 'Population']
pop_df.head()

  Country Name Country Code  Year  Population
0        Aruba          ABW  1960     54211.0
1        Aruba          ABW  1961     55438.0
2        Aruba          ABW  1962     56225.0
3        Aruba          ABW  1963     56695.0
4        Aruba          ABW  1964     57032.0

In [33]:
gdp_df = gdp_percap.set_index(['Country Name', 'Country Code']).iloc[:, 2:].stack().reset_index()
gdp_df.columns = ['Country Name', 'Country Code', 'Year', 'GDP per capita']
gdp_df.head()

  Country Name Country Code  Year  GDP per capita
0        Aruba          ABW  1986     6472.502029
1        Aruba          ABW  1987     7885.796545
2        Aruba          ABW  1988     9764.789979
3        Aruba          ABW  1989    11392.455811
4        Aruba          ABW  1990    12307.311738

In [26]:
len(pop_df)

15409

In [27]:
len(gdp_df)

15840

In [29]:
pop_df.head()

  Country Name Country Code  Year  Population
0        Aruba          ABW  1960     54211.0
1        Aruba          ABW  1961     55438.0
2        Aruba          ABW  1962     56225.0
3        Aruba          ABW  1963     56695.0
4        Aruba          ABW  1964     57032.0

In [30]:
gdp_df.head()

  Country Name Country Code  Year  GDP per capita
0        Aruba          ABW  1960             NaN
1        Aruba          ABW  1961             NaN
2        Aruba          ABW  1962             NaN
3        Aruba          ABW  1963             NaN
4        Aruba          ABW  1964             NaN

In [43]:
final=pd.merge(pop_df, gdp_df, left_on=['Country Code', 'Year'], right_on=['Country Code', 'Year'], suffixes=["","_r"], how='outer')

In [44]:
final.head()

  Country Name Country Code  Year  Population Country Name_r  GDP per capita
0        Aruba          ABW  1960     54211.0            NaN             NaN
1        Aruba          ABW  1961     55438.0            NaN             NaN
2        Aruba          ABW  1962     56225.0            NaN             NaN
3        Aruba          ABW  1963     56695.0            NaN             NaN
4        Aruba          ABW  1964     57032.0            NaN             NaN

In [46]:
final[['Year', 'Country Name', 'Country Code', 'Population','GDP per capita']]

       Year Country Name Country Code  Population  GDP per capita
0      1960        Aruba          ABW     54211.0             NaN
1      1961        Aruba          ABW     55438.0             NaN
2      1962        Aruba          ABW     56225.0             NaN
3      1963        Aruba          ABW     56695.0             NaN
4      1964        Aruba          ABW     57032.0             NaN
...     ...          ...          ...         ...             ...
15404  2014     Zimbabwe          ZWE  13586681.0     1434.899340
15405  2015     Zimbabwe          ZWE  13814629.0     1445.071062
15406  2016     Zimbabwe          ZWE  14030390.0     1464.583529
15407  2017     Zimbabwe          ZWE  14236745.0     1602.403507
15408  2018     Zimbabwe          ZWE  14439018.0     2146.996385

[15409 rows x 5 columns]